Revit 2027 API
LevelAssociationData.GetLevelAssociationData Method
 Returns LevelAssociationData associated with this element, if it exists.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static LevelAssociationData GetLevelAssociationData(
	Element element
)
Public Shared Function GetLevelAssociationData (
	element As Element
) As LevelAssociationData
public:
static LevelAssociationData^ GetLevelAssociationData(
	Element^ element
)
static member GetLevelAssociationData :
        element : Element -> LevelAssociationData
Parameters
element Element
 The element from which we try to obtain LevelAssociationData.
Return Value
LevelAssociationData
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 If the input element doesn't have LevelAssociationData than it retuns null.
See Also
Reference
LevelAssociationData Class
Autodesk.Revit.DB Namespace